package leetcode.editor.cn;//给定一个整数数组 nums 和一个整数目标值 target，请你在该数组中找出 和为目标值 的那 两个 整数，并返回它们的数组下标。
//
// 你可以假设每种输入只会对应一个答案。但是，数组中同一个元素在答案里不能重复出现。 
//
// 你可以按任意顺序返回答案。 
//
// 
//
// 示例 1： 
//
// 
//输入：nums = [2,7,11,15], target = 9
//输出：[0,1]
//解释：因为 nums[0] + nums[1] == 9 ，返回 [0, 1] 。
// 
//
// 示例 2： 
//
// 
//输入：nums = [3,2,4], target = 6
//输出：[1,2]
// 
//
// 示例 3： 
//
// 
//输入：nums = [3,3], target = 6
//输出：[0,1]
// 
//
// 
//
// 提示： 
//
// 
// 2 <= nums.length <= 103 
// -109 <= nums[i] <= 109 
// -109 <= target <= 109 
// 只会存在一个有效答案 
// 
// Related Topics 数组 哈希表 
// 👍 10871 👎 0


import java.util.HashMap;

/**
 * 解决思路:
 * 遍历nums数组,  获取差值 int sub = target - nums[i]
 * 如果sub在HashMap中存在, 就返回i和hashMap.get(sub)的下标
 * 如果不存在, 就把当前nums[i] 和它下标put到hashMap 进行下一次比较
 * <p>
 * <p>
 * 运行结果:
 * 执行用时：0 ms, 在所有 Java 提交中击败了100.00%的用户
 * 内存消耗：38.7 MB, 在所有 Java 提交中击败了36.83%的用户
 */
class TwoSum {
    public int[] twoSum(int[] nums, int target) {
        HashMap<Integer, Integer> hashMap = new HashMap<>(103);
        //遍历nums数组
        for (int i = 0; i < nums.length; i++) {
            int sub = target - nums[i];
            //如果hashMap包含我们的sub
            if (hashMap.containsKey(sub)) {
                //就返回i和hashMap.get(sub)的下标.
                return new int[]{i, hashMap.get(sub)};
            }
            //如果不包含, 就把nums[i]和索引i提交到HashMap中
            hashMap.put(nums[i], i);
        }
        return new int[0];
    }
}

